Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpdma.h
// SECCFGR Configuration

#define GPDMA_SECCFGR_SEC11             (0x1u<<11)
#define GPDMA_SECCFGR_SEC10             (0x1u<<10)
#define GPDMA_SECCFGR_SEC9              (0x1u<<9)
#define GPDMA_SECCFGR_SEC8              (0x1u<<8)
#define GPDMA_SECCFGR_SEC7              (0x1u<<7)
#define GPDMA_SECCFGR_SEC6              (0x1u<<6)
#define GPDMA_SECCFGR_SEC5              (0x1u<<5)
#define GPDMA_SECCFGR_SEC4              (0x1u<<4)
#define GPDMA_SECCFGR_SEC3              (0x1u<<3)
#define GPDMA_SECCFGR_SEC2              (0x1u<<2)
#define GPDMA_SECCFGR_SEC1              (0x1u<<1)
#define GPDMA_SECCFGR_SEC0              (0x1u<<0)

#define GPDMA_SECCFGR_SEC11_B_0X0       (0x0u<<11)
#define GPDMA_SECCFGR_SEC11_B_0X1       (0x1u<<11)
#define GPDMA_SECCFGR_SEC10_B_0X0       (0x0u<<10)
#define GPDMA_SECCFGR_SEC10_B_0X1       (0x1u<<10)
#define GPDMA_SECCFGR_SEC9_B_0X0        (0x0u<<9)
#define GPDMA_SECCFGR_SEC9_B_0X1        (0x1u<<9)
#define GPDMA_SECCFGR_SEC8_B_0X0        (0x0u<<8)
#define GPDMA_SECCFGR_SEC8_B_0X1        (0x1u<<8)
#define GPDMA_SECCFGR_SEC7_B_0X0        (0x0u<<7)
#define GPDMA_SECCFGR_SEC7_B_0X1        (0x1u<<7)
#define GPDMA_SECCFGR_SEC6_B_0X0        (0x0u<<6)
#define GPDMA_SECCFGR_SEC6_B_0X1        (0x1u<<6)
#define GPDMA_SECCFGR_SEC5_B_0X0        (0x0u<<5)
#define GPDMA_SECCFGR_SEC5_B_0X1        (0x1u<<5)
#define GPDMA_SECCFGR_SEC4_B_0X0        (0x0u<<4)
#define GPDMA_SECCFGR_SEC4_B_0X1        (0x1u<<4)
#define GPDMA_SECCFGR_SEC3_B_0X0        (0x0u<<3)
#define GPDMA_SECCFGR_SEC3_B_0X1        (0x1u<<3)
#define GPDMA_SECCFGR_SEC2_B_0X0        (0x0u<<2)
#define GPDMA_SECCFGR_SEC2_B_0X1        (0x1u<<2)
#define GPDMA_SECCFGR_SEC1_B_0X0        (0x0u<<1)
#define GPDMA_SECCFGR_SEC1_B_0X1        (0x1u<<1)
#define GPDMA_SECCFGR_SEC0_B_0X0        (0x0u<<0)
#define GPDMA_SECCFGR_SEC0_B_0X1        (0x1u<<0)

// PRIVCFGR Configuration

#define GPDMA_PRIVCFGR_PRIV11           (0x1u<<11)
#define GPDMA_PRIVCFGR_PRIV10           (0x1u<<10)
#define GPDMA_PRIVCFGR_PRIV9            (0x1u<<9)
#define GPDMA_PRIVCFGR_PRIV8            (0x1u<<8)
#define GPDMA_PRIVCFGR_PRIV7            (0x1u<<7)
#define GPDMA_PRIVCFGR_PRIV6            (0x1u<<6)
#define GPDMA_PRIVCFGR_PRIV5            (0x1u<<5)
#define GPDMA_PRIVCFGR_PRIV4            (0x1u<<4)
#define GPDMA_PRIVCFGR_PRIV3            (0x1u<<3)
#define GPDMA_PRIVCFGR_PRIV2            (0x1u<<2)
#define GPDMA_PRIVCFGR_PRIV1            (0x1u<<1)
#define GPDMA_PRIVCFGR_PRIV0            (0x1u<<0)

#define GPDMA_PRIVCFGR_PRIV11_B_0X0     (0x0u<<11)
#define GPDMA_PRIVCFGR_PRIV11_B_0X1     (0x1u<<11)
#define GPDMA_PRIVCFGR_PRIV10_B_0X0     (0x0u<<10)
#define GPDMA_PRIVCFGR_PRIV10_B_0X1     (0x1u<<10)
#define GPDMA_PRIVCFGR_PRIV9_B_0X0      (0x0u<<9)
#define GPDMA_PRIVCFGR_PRIV9_B_0X1      (0x1u<<9)
#define GPDMA_PRIVCFGR_PRIV8_B_0X0      (0x0u<<8)
#define GPDMA_PRIVCFGR_PRIV8_B_0X1      (0x1u<<8)
#define GPDMA_PRIVCFGR_PRIV7_B_0X0      (0x0u<<7)
#define GPDMA_PRIVCFGR_PRIV7_B_0X1      (0x1u<<7)
#define GPDMA_PRIVCFGR_PRIV6_B_0X0      (0x0u<<6)
#define GPDMA_PRIVCFGR_PRIV6_B_0X1      (0x1u<<6)
#define GPDMA_PRIVCFGR_PRIV5_B_0X0      (0x0u<<5)
#define GPDMA_PRIVCFGR_PRIV5_B_0X1      (0x1u<<5)
#define GPDMA_PRIVCFGR_PRIV4_B_0X0      (0x0u<<4)
#define GPDMA_PRIVCFGR_PRIV4_B_0X1      (0x1u<<4)
#define GPDMA_PRIVCFGR_PRIV3_B_0X0      (0x0u<<3)
#define GPDMA_PRIVCFGR_PRIV3_B_0X1      (0x1u<<3)
#define GPDMA_PRIVCFGR_PRIV2_B_0X0      (0x0u<<2)
#define GPDMA_PRIVCFGR_PRIV2_B_0X1      (0x1u<<2)
#define GPDMA_PRIVCFGR_PRIV1_B_0X0      (0x0u<<1)
#define GPDMA_PRIVCFGR_PRIV1_B_0X1      (0x1u<<1)
#define GPDMA_PRIVCFGR_PRIV0_B_0X0      (0x0u<<0)
#define GPDMA_PRIVCFGR_PRIV0_B_0X1      (0x1u<<0)

// RCFGLOCKR Configuration

#define GPDMA_RCFGLOCKR_LOCK11          (0x1u<<11)
#define GPDMA_RCFGLOCKR_LOCK10          (0x1u<<10)
#define GPDMA_RCFGLOCKR_LOCK9           (0x1u<<9)
#define GPDMA_RCFGLOCKR_LOCK8           (0x1u<<8)
#define GPDMA_RCFGLOCKR_LOCK7           (0x1u<<7)
#define GPDMA_RCFGLOCKR_LOCK6           (0x1u<<6)
#define GPDMA_RCFGLOCKR_LOCK5           (0x1u<<5)
#define GPDMA_RCFGLOCKR_LOCK4           (0x1u<<4)
#define GPDMA_RCFGLOCKR_LOCK3           (0x1u<<3)
#define GPDMA_RCFGLOCKR_LOCK2           (0x1u<<2)
#define GPDMA_RCFGLOCKR_LOCK1           (0x1u<<1)
#define GPDMA_RCFGLOCKR_LOCK0           (0x1u<<0)

#define GPDMA_RCFGLOCKR_LOCK11_B_0X0    (0x0u<<11)
#define GPDMA_RCFGLOCKR_LOCK11_B_0X1    (0x1u<<11)
#define GPDMA_RCFGLOCKR_LOCK10_B_0X0    (0x0u<<10)
#define GPDMA_RCFGLOCKR_LOCK10_B_0X1    (0x1u<<10)
#define GPDMA_RCFGLOCKR_LOCK9_B_0X0     (0x0u<<9)
#define GPDMA_RCFGLOCKR_LOCK9_B_0X1     (0x1u<<9)
#define GPDMA_RCFGLOCKR_LOCK8_B_0X0     (0x0u<<8)
#define GPDMA_RCFGLOCKR_LOCK8_B_0X1     (0x1u<<8)
#define GPDMA_RCFGLOCKR_LOCK7_B_0X0     (0x0u<<7)
#define GPDMA_RCFGLOCKR_LOCK7_B_0X1     (0x1u<<7)
#define GPDMA_RCFGLOCKR_LOCK6_B_0X0     (0x0u<<6)
#define GPDMA_RCFGLOCKR_LOCK6_B_0X1     (0x1u<<6)
#define GPDMA_RCFGLOCKR_LOCK5_B_0X0     (0x0u<<5)
#define GPDMA_RCFGLOCKR_LOCK5_B_0X1     (0x1u<<5)
#define GPDMA_RCFGLOCKR_LOCK4_B_0X0     (0x0u<<4)
#define GPDMA_RCFGLOCKR_LOCK4_B_0X1     (0x1u<<4)
#define GPDMA_RCFGLOCKR_LOCK3_B_0X0     (0x0u<<3)
#define GPDMA_RCFGLOCKR_LOCK3_B_0X1     (0x1u<<3)
#define GPDMA_RCFGLOCKR_LOCK2_B_0X0     (0x0u<<2)
#define GPDMA_RCFGLOCKR_LOCK2_B_0X1     (0x1u<<2)
#define GPDMA_RCFGLOCKR_LOCK1_B_0X0     (0x0u<<1)
#define GPDMA_RCFGLOCKR_LOCK1_B_0X1     (0x1u<<1)
#define GPDMA_RCFGLOCKR_LOCK0_B_0X0     (0x0u<<0)
#define GPDMA_RCFGLOCKR_LOCK0_B_0X1     (0x1u<<0)

// MISR Configuration

#define GPDMA_MISR_MIS11                (0x1u<<11)
#define GPDMA_MISR_MIS10                (0x1u<<10)
#define GPDMA_MISR_MIS9                 (0x1u<<9)
#define GPDMA_MISR_MIS8                 (0x1u<<8)
#define GPDMA_MISR_MIS7                 (0x1u<<7)
#define GPDMA_MISR_MIS6                 (0x1u<<6)
#define GPDMA_MISR_MIS5                 (0x1u<<5)
#define GPDMA_MISR_MIS4                 (0x1u<<4)
#define GPDMA_MISR_MIS3                 (0x1u<<3)
#define GPDMA_MISR_MIS2                 (0x1u<<2)
#define GPDMA_MISR_MIS1                 (0x1u<<1)
#define GPDMA_MISR_MIS0                 (0x1u<<0)

#define GPDMA_MISR_MIS11_B_0X0          (0x0u<<11)
#define GPDMA_MISR_MIS11_B_0X1          (0x1u<<11)
#define GPDMA_MISR_MIS10_B_0X0          (0x0u<<10)
#define GPDMA_MISR_MIS10_B_0X1          (0x1u<<10)
#define GPDMA_MISR_MIS9_B_0X0           (0x0u<<9)
#define GPDMA_MISR_MIS9_B_0X1           (0x1u<<9)
#define GPDMA_MISR_MIS8_B_0X0           (0x0u<<8)
#define GPDMA_MISR_MIS8_B_0X1           (0x1u<<8)
#define GPDMA_MISR_MIS7_B_0X0           (0x0u<<7)
#define GPDMA_MISR_MIS7_B_0X1           (0x1u<<7)
#define GPDMA_MISR_MIS6_B_0X0           (0x0u<<6)
#define GPDMA_MISR_MIS6_B_0X1           (0x1u<<6)
#define GPDMA_MISR_MIS5_B_0X0           (0x0u<<5)
#define GPDMA_MISR_MIS5_B_0X1           (0x1u<<5)
#define GPDMA_MISR_MIS4_B_0X0           (0x0u<<4)
#define GPDMA_MISR_MIS4_B_0X1           (0x1u<<4)
#define GPDMA_MISR_MIS3_B_0X0           (0x0u<<3)
#define GPDMA_MISR_MIS3_B_0X1           (0x1u<<3)
#define GPDMA_MISR_MIS2_B_0X0           (0x0u<<2)
#define GPDMA_MISR_MIS2_B_0X1           (0x1u<<2)
#define GPDMA_MISR_MIS1_B_0X0           (0x0u<<1)
#define GPDMA_MISR_MIS1_B_0X1           (0x1u<<1)
#define GPDMA_MISR_MIS0_B_0X0           (0x0u<<0)
#define GPDMA_MISR_MIS0_B_0X1           (0x1u<<0)

// SMISR Configuration

