Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpdma.h
#define GPDMA_SMISR_MIS11               (0x1u<<11)
#define GPDMA_SMISR_MIS10               (0x1u<<10)
#define GPDMA_SMISR_MIS9                (0x1u<<9)
#define GPDMA_SMISR_MIS8                (0x1u<<8)
#define GPDMA_SMISR_MIS7                (0x1u<<7)
#define GPDMA_SMISR_MIS6                (0x1u<<6)
#define GPDMA_SMISR_MIS5                (0x1u<<5)
#define GPDMA_SMISR_MIS4                (0x1u<<4)
#define GPDMA_SMISR_MIS3                (0x1u<<3)
#define GPDMA_SMISR_MIS2                (0x1u<<2)
#define GPDMA_SMISR_MIS1                (0x1u<<1)
#define GPDMA_SMISR_MIS0                (0x1u<<0)

#define GPDMA_SMISR_MIS11_B_0X0         (0x0u<<11)
#define GPDMA_SMISR_MIS11_B_0X1         (0x1u<<11)
#define GPDMA_SMISR_MIS10_B_0X0         (0x0u<<10)
#define GPDMA_SMISR_MIS10_B_0X1         (0x1u<<10)
#define GPDMA_SMISR_MIS9_B_0X0          (0x0u<<9)
#define GPDMA_SMISR_MIS9_B_0X1          (0x1u<<9)
#define GPDMA_SMISR_MIS8_B_0X0          (0x0u<<8)
#define GPDMA_SMISR_MIS8_B_0X1          (0x1u<<8)
#define GPDMA_SMISR_MIS7_B_0X0          (0x0u<<7)
#define GPDMA_SMISR_MIS7_B_0X1          (0x1u<<7)
#define GPDMA_SMISR_MIS6_B_0X0          (0x0u<<6)
#define GPDMA_SMISR_MIS6_B_0X1          (0x1u<<6)
#define GPDMA_SMISR_MIS5_B_0X0          (0x0u<<5)
#define GPDMA_SMISR_MIS5_B_0X1          (0x1u<<5)
#define GPDMA_SMISR_MIS4_B_0X0          (0x0u<<4)
#define GPDMA_SMISR_MIS4_B_0X1          (0x1u<<4)
#define GPDMA_SMISR_MIS3_B_0X0          (0x0u<<3)
#define GPDMA_SMISR_MIS3_B_0X1          (0x1u<<3)
#define GPDMA_SMISR_MIS2_B_0X0          (0x0u<<2)
#define GPDMA_SMISR_MIS2_B_0X1          (0x1u<<2)
#define GPDMA_SMISR_MIS1_B_0X0          (0x0u<<1)
#define GPDMA_SMISR_MIS1_B_0X1          (0x1u<<1)
#define GPDMA_SMISR_MIS0_B_0X0          (0x0u<<0)
#define GPDMA_SMISR_MIS0_B_0X1          (0x1u<<0)

// C0LBAR Configuration

#define GPDMA_C0LBAR_LBA                (0xFFFFu<<16)
#define GPDMA_C0LBAR_LBA_0              (0x1u<<16)

// C0FCR Configuration

#define GPDMA_C0FCR_TOF                 (0x1u<<14)
#define GPDMA_C0FCR_SUSPF               (0x1u<<13)
#define GPDMA_C0FCR_USEF                (0x1u<<12)
#define GPDMA_C0FCR_ULEF                (0x1u<<11)
#define GPDMA_C0FCR_DTEF                (0x1u<<10)
#define GPDMA_C0FCR_HTF                 (0x1u<<9)
#define GPDMA_C0FCR_TCF                 (0x1u<<8)

#define GPDMA_C0FCR_TOF_B_0X0           (0x0u<<14)
#define GPDMA_C0FCR_TOF_B_0X1           (0x1u<<14)
#define GPDMA_C0FCR_SUSPF_B_0X0         (0x0u<<13)
#define GPDMA_C0FCR_SUSPF_B_0X1         (0x1u<<13)
#define GPDMA_C0FCR_USEF_B_0X0          (0x0u<<12)
#define GPDMA_C0FCR_USEF_B_0X1          (0x1u<<12)
#define GPDMA_C0FCR_ULEF_B_0X0          (0x0u<<11)
#define GPDMA_C0FCR_ULEF_B_0X1          (0x1u<<11)
#define GPDMA_C0FCR_DTEF_B_0X0          (0x0u<<10)
#define GPDMA_C0FCR_DTEF_B_0X1          (0x1u<<10)
#define GPDMA_C0FCR_HTF_B_0X0           (0x0u<<9)
#define GPDMA_C0FCR_HTF_B_0X1           (0x1u<<9)
#define GPDMA_C0FCR_TCF_B_0X0           (0x0u<<8)
#define GPDMA_C0FCR_TCF_B_0X1           (0x1u<<8)

// C0SR Configuration

#define GPDMA_C0SR_FIFOL                (0xFFu<<16)
#define GPDMA_C0SR_FIFOL_0              (0x1u<<16)
#define GPDMA_C0SR_TOF                  (0x1u<<14)
#define GPDMA_C0SR_SUSPF                (0x1u<<13)
#define GPDMA_C0SR_USEF                 (0x1u<<12)
#define GPDMA_C0SR_ULEF                 (0x1u<<11)
#define GPDMA_C0SR_DTEF                 (0x1u<<10)
#define GPDMA_C0SR_HTF                  (0x1u<<9)
#define GPDMA_C0SR_TCF                  (0x1u<<8)
#define GPDMA_C0SR_IDLEF                (0x1u<<0)

#define GPDMA_C0SR_TOF_B_0X0            (0x0u<<14)
#define GPDMA_C0SR_TOF_B_0X1            (0x1u<<14)
#define GPDMA_C0SR_SUSPF_B_0X0          (0x0u<<13)
#define GPDMA_C0SR_SUSPF_B_0X1          (0x1u<<13)
#define GPDMA_C0SR_USEF_B_0X0           (0x0u<<12)
#define GPDMA_C0SR_USEF_B_0X1           (0x1u<<12)
#define GPDMA_C0SR_ULEF_B_0X0           (0x0u<<11)
#define GPDMA_C0SR_ULEF_B_0X1           (0x1u<<11)
#define GPDMA_C0SR_DTEF_B_0X0           (0x0u<<10)
#define GPDMA_C0SR_DTEF_B_0X1           (0x1u<<10)
#define GPDMA_C0SR_HTF_B_0X0            (0x0u<<9)
#define GPDMA_C0SR_HTF_B_0X1            (0x1u<<9)
#define GPDMA_C0SR_TCF_B_0X0            (0x0u<<8)
#define GPDMA_C0SR_TCF_B_0X1            (0x1u<<8)
#define GPDMA_C0SR_IDLEF_B_0X0          (0x0u<<0)
#define GPDMA_C0SR_IDLEF_B_0X1          (0x1u<<0)

// C0CR Configuration

#define GPDMA_C0CR_PRIO                 (0x3u<<22)
#define GPDMA_C0CR_PRIO_0               (0x1u<<22)
#define GPDMA_C0CR_LAP                  (0x1u<<17)
#define GPDMA_C0CR_LSM                  (0x1u<<16)
#define GPDMA_C0CR_TOIE                 (0x1u<<14)
#define GPDMA_C0CR_SUSPIE               (0x1u<<13)
#define GPDMA_C0CR_USEIE                (0x1u<<12)
#define GPDMA_C0CR_ULEIE                (0x1u<<11)
#define GPDMA_C0CR_DTEIE                (0x1u<<10)
#define GPDMA_C0CR_HTIE                 (0x1u<<9)
#define GPDMA_C0CR_TCIE                 (0x1u<<8)
#define GPDMA_C0CR_SUSP                 (0x1u<<2)
#define GPDMA_C0CR_RESET                (0x1u<<1)
#define GPDMA_C0CR_EN                   (0x1u<<0)

#define GPDMA_C0CR_PRIO_B_0X0           (0x0u<<22)
#define GPDMA_C0CR_PRIO_B_0X1           (0x1u<<22)
#define GPDMA_C0CR_PRIO_B_0X2           (0x2u<<22)
#define GPDMA_C0CR_PRIO_B_0X3           (0x3u<<22)
#define GPDMA_C0CR_LAP_B_0X0            (0x0u<<17)
#define GPDMA_C0CR_LAP_B_0X1            (0x1u<<17)
#define GPDMA_C0CR_LSM_B_0X0            (0x0u<<16)
#define GPDMA_C0CR_LSM_B_0X1            (0x1u<<16)
#define GPDMA_C0CR_TOIE_B_0X0           (0x0u<<14)
#define GPDMA_C0CR_TOIE_B_0X1           (0x1u<<14)
#define GPDMA_C0CR_SUSPIE_B_0X0         (0x0u<<13)
#define GPDMA_C0CR_SUSPIE_B_0X1         (0x1u<<13)
#define GPDMA_C0CR_USEIE_B_0X0          (0x0u<<12)
#define GPDMA_C0CR_USEIE_B_0X1          (0x1u<<12)
#define GPDMA_C0CR_ULEIE_B_0X0          (0x0u<<11)
#define GPDMA_C0CR_ULEIE_B_0X1          (0x1u<<11)
#define GPDMA_C0CR_DTEIE_B_0X0          (0x0u<<10)
#define GPDMA_C0CR_DTEIE_B_0X1          (0x1u<<10)
#define GPDMA_C0CR_HTIE_B_0X0           (0x0u<<9)
#define GPDMA_C0CR_HTIE_B_0X1           (0x1u<<9)
#define GPDMA_C0CR_TCIE_B_0X0           (0x0u<<8)
#define GPDMA_C0CR_TCIE_B_0X1           (0x1u<<8)
#define GPDMA_C0CR_SUSP_B_0X0           (0x0u<<2)
#define GPDMA_C0CR_SUSP_B_0X1           (0x1u<<2)
#define GPDMA_C0CR_RESET_B_0X0          (0x0u<<1)
#define GPDMA_C0CR_RESET_B_0X1          (0x1u<<1)
#define GPDMA_C0CR_EN_B_0X0             (0x0u<<0)
#define GPDMA_C0CR_EN_B_0X1             (0x1u<<0)

// C0TR1 Configuration

