Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpdma.h
#define GPDMA_C3LLR_UT1                 (0x1u<<31)
#define GPDMA_C3LLR_UT2                 (0x1u<<30)
#define GPDMA_C3LLR_UB1                 (0x1u<<29)
#define GPDMA_C3LLR_USA                 (0x1u<<28)
#define GPDMA_C3LLR_UDA                 (0x1u<<27)
#define GPDMA_C3LLR_ULL                 (0x1u<<16)
#define GPDMA_C3LLR_LA                  (0x3FFFu<<2)
#define GPDMA_C3LLR_LA_0                (0x1u<<2)

#define GPDMA_C3LLR_UT1_B_0X0           (0x0u<<31)
#define GPDMA_C3LLR_UT1_B_0X1           (0x1u<<31)
#define GPDMA_C3LLR_UT2_B_0X0           (0x0u<<30)
#define GPDMA_C3LLR_UT2_B_0X1           (0x1u<<30)
#define GPDMA_C3LLR_UB1_B_0X0           (0x0u<<29)
#define GPDMA_C3LLR_UB1_B_0X1           (0x1u<<29)
#define GPDMA_C3LLR_USA_B_0X0           (0x0u<<28)
#define GPDMA_C3LLR_USA_B_0X1           (0x1u<<28)
#define GPDMA_C3LLR_UDA_B_0X0           (0x0u<<27)
#define GPDMA_C3LLR_UDA_B_0X1           (0x1u<<27)
#define GPDMA_C3LLR_ULL_B_0X0           (0x0u<<16)
#define GPDMA_C3LLR_ULL_B_0X1           (0x1u<<16)

// C4LBAR Configuration

#define GPDMA_C4LBAR_LBA                (0xFFFFu<<16)
#define GPDMA_C4LBAR_LBA_0              (0x1u<<16)

// C4FCR Configuration

#define GPDMA_C4FCR_TOF                 (0x1u<<14)
#define GPDMA_C4FCR_SUSPF               (0x1u<<13)
#define GPDMA_C4FCR_USEF                (0x1u<<12)
#define GPDMA_C4FCR_ULEF                (0x1u<<11)
#define GPDMA_C4FCR_DTEF                (0x1u<<10)
#define GPDMA_C4FCR_HTF                 (0x1u<<9)
#define GPDMA_C4FCR_TCF                 (0x1u<<8)

#define GPDMA_C4FCR_TOF_B_0X0           (0x0u<<14)
#define GPDMA_C4FCR_TOF_B_0X1           (0x1u<<14)
#define GPDMA_C4FCR_SUSPF_B_0X0         (0x0u<<13)
#define GPDMA_C4FCR_SUSPF_B_0X1         (0x1u<<13)
#define GPDMA_C4FCR_USEF_B_0X0          (0x0u<<12)
#define GPDMA_C4FCR_USEF_B_0X1          (0x1u<<12)
#define GPDMA_C4FCR_ULEF_B_0X0          (0x0u<<11)
#define GPDMA_C4FCR_ULEF_B_0X1          (0x1u<<11)
#define GPDMA_C4FCR_DTEF_B_0X0          (0x0u<<10)
#define GPDMA_C4FCR_DTEF_B_0X1          (0x1u<<10)
#define GPDMA_C4FCR_HTF_B_0X0           (0x0u<<9)
#define GPDMA_C4FCR_HTF_B_0X1           (0x1u<<9)
#define GPDMA_C4FCR_TCF_B_0X0           (0x0u<<8)
#define GPDMA_C4FCR_TCF_B_0X1           (0x1u<<8)

// C4SR Configuration

#define GPDMA_C4SR_FIFOL                (0xFFu<<16)
#define GPDMA_C4SR_FIFOL_0              (0x1u<<16)
#define GPDMA_C4SR_TOF                  (0x1u<<14)
#define GPDMA_C4SR_SUSPF                (0x1u<<13)
#define GPDMA_C4SR_USEF                 (0x1u<<12)
#define GPDMA_C4SR_ULEF                 (0x1u<<11)
#define GPDMA_C4SR_DTEF                 (0x1u<<10)
#define GPDMA_C4SR_HTF                  (0x1u<<9)
#define GPDMA_C4SR_TCF                  (0x1u<<8)
#define GPDMA_C4SR_IDLEF                (0x1u<<0)

#define GPDMA_C4SR_TOF_B_0X0            (0x0u<<14)
#define GPDMA_C4SR_TOF_B_0X1            (0x1u<<14)
#define GPDMA_C4SR_SUSPF_B_0X0          (0x0u<<13)
#define GPDMA_C4SR_SUSPF_B_0X1          (0x1u<<13)
#define GPDMA_C4SR_USEF_B_0X0           (0x0u<<12)
#define GPDMA_C4SR_USEF_B_0X1           (0x1u<<12)
#define GPDMA_C4SR_ULEF_B_0X0           (0x0u<<11)
#define GPDMA_C4SR_ULEF_B_0X1           (0x1u<<11)
#define GPDMA_C4SR_DTEF_B_0X0           (0x0u<<10)
#define GPDMA_C4SR_DTEF_B_0X1           (0x1u<<10)
#define GPDMA_C4SR_HTF_B_0X0            (0x0u<<9)
#define GPDMA_C4SR_HTF_B_0X1            (0x1u<<9)
#define GPDMA_C4SR_TCF_B_0X0            (0x0u<<8)
#define GPDMA_C4SR_TCF_B_0X1            (0x1u<<8)
#define GPDMA_C4SR_IDLEF_B_0X0          (0x0u<<0)
#define GPDMA_C4SR_IDLEF_B_0X1          (0x1u<<0)

// C4CR Configuration

#define GPDMA_C4CR_PRIO                 (0x3u<<22)
#define GPDMA_C4CR_PRIO_0               (0x1u<<22)
#define GPDMA_C4CR_LAP                  (0x1u<<17)
#define GPDMA_C4CR_LSM                  (0x1u<<16)
#define GPDMA_C4CR_TOIE                 (0x1u<<14)
#define GPDMA_C4CR_SUSPIE               (0x1u<<13)
#define GPDMA_C4CR_USEIE                (0x1u<<12)
#define GPDMA_C4CR_ULEIE                (0x1u<<11)
#define GPDMA_C4CR_DTEIE                (0x1u<<10)
#define GPDMA_C4CR_HTIE                 (0x1u<<9)
#define GPDMA_C4CR_TCIE                 (0x1u<<8)
#define GPDMA_C4CR_SUSP                 (0x1u<<2)
#define GPDMA_C4CR_RESET                (0x1u<<1)
#define GPDMA_C4CR_EN                   (0x1u<<0)

#define GPDMA_C4CR_PRIO_B_0X0           (0x0u<<22)
#define GPDMA_C4CR_PRIO_B_0X1           (0x1u<<22)
#define GPDMA_C4CR_PRIO_B_0X2           (0x2u<<22)
#define GPDMA_C4CR_PRIO_B_0X3           (0x3u<<22)
#define GPDMA_C4CR_LAP_B_0X0            (0x0u<<17)
#define GPDMA_C4CR_LAP_B_0X1            (0x1u<<17)
#define GPDMA_C4CR_LSM_B_0X0            (0x0u<<16)
#define GPDMA_C4CR_LSM_B_0X1            (0x1u<<16)
#define GPDMA_C4CR_TOIE_B_0X0           (0x0u<<14)
#define GPDMA_C4CR_TOIE_B_0X1           (0x1u<<14)
#define GPDMA_C4CR_SUSPIE_B_0X0         (0x0u<<13)
#define GPDMA_C4CR_SUSPIE_B_0X1         (0x1u<<13)
#define GPDMA_C4CR_USEIE_B_0X0          (0x0u<<12)
#define GPDMA_C4CR_USEIE_B_0X1          (0x1u<<12)
#define GPDMA_C4CR_ULEIE_B_0X0          (0x0u<<11)
#define GPDMA_C4CR_ULEIE_B_0X1          (0x1u<<11)
#define GPDMA_C4CR_DTEIE_B_0X0          (0x0u<<10)
#define GPDMA_C4CR_DTEIE_B_0X1          (0x1u<<10)
#define GPDMA_C4CR_HTIE_B_0X0           (0x0u<<9)
#define GPDMA_C4CR_HTIE_B_0X1           (0x1u<<9)
#define GPDMA_C4CR_TCIE_B_0X0           (0x0u<<8)
#define GPDMA_C4CR_TCIE_B_0X1           (0x1u<<8)
#define GPDMA_C4CR_SUSP_B_0X0           (0x0u<<2)
#define GPDMA_C4CR_SUSP_B_0X1           (0x1u<<2)
#define GPDMA_C4CR_RESET_B_0X0          (0x0u<<1)
#define GPDMA_C4CR_RESET_B_0X1          (0x1u<<1)
#define GPDMA_C4CR_EN_B_0X0             (0x0u<<0)
#define GPDMA_C4CR_EN_B_0X1             (0x1u<<0)

// C4TR1 Configuration

#define GPDMA_C4TR1_DSEC                (0x1u<<31)
#define GPDMA_C4TR1_DAP                 (0x1u<<30)
#define GPDMA_C4TR1_DHX                 (0x1u<<27)
#define GPDMA_C4TR1_DBX                 (0x1u<<26)
#define GPDMA_C4TR1_DBL_1               (0x3Fu<<20)
#define GPDMA_C4TR1_DBL_1_0             (0x1u<<20)
#define GPDMA_C4TR1_DINC                (0x1u<<19)
#define GPDMA_C4TR1_DDW_LOG2            (0x3u<<16)
#define GPDMA_C4TR1_DDW_LOG2_0          (0x1u<<16)
#define GPDMA_C4TR1_SSEC                (0x1u<<15)
#define GPDMA_C4TR1_SAP                 (0x1u<<14)
#define GPDMA_C4TR1_SBX                 (0x1u<<13)
#define GPDMA_C4TR1_PAM                 (0x3u<<11)
#define GPDMA_C4TR1_PAM_0               (0x1u<<11)
#define GPDMA_C4TR1_SBL_1               (0x3Fu<<4)
#define GPDMA_C4TR1_SBL_1_0             (0x1u<<4)
#define GPDMA_C4TR1_SINC                (0x1u<<3)
#define GPDMA_C4TR1_SDW_LOG2            (0x3u<<0)
#define GPDMA_C4TR1_SDW_LOG2_0          (0x1u<<0)

