Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpdma.h
#define GPDMA_C6SR_FIFOL                (0xFFu<<16)
#define GPDMA_C6SR_FIFOL_0              (0x1u<<16)
#define GPDMA_C6SR_TOF                  (0x1u<<14)
#define GPDMA_C6SR_SUSPF                (0x1u<<13)
#define GPDMA_C6SR_USEF                 (0x1u<<12)
#define GPDMA_C6SR_ULEF                 (0x1u<<11)
#define GPDMA_C6SR_DTEF                 (0x1u<<10)
#define GPDMA_C6SR_HTF                  (0x1u<<9)
#define GPDMA_C6SR_TCF                  (0x1u<<8)
#define GPDMA_C6SR_IDLEF                (0x1u<<0)

#define GPDMA_C6SR_TOF_B_0X0            (0x0u<<14)
#define GPDMA_C6SR_TOF_B_0X1            (0x1u<<14)
#define GPDMA_C6SR_SUSPF_B_0X0          (0x0u<<13)
#define GPDMA_C6SR_SUSPF_B_0X1          (0x1u<<13)
#define GPDMA_C6SR_USEF_B_0X0           (0x0u<<12)
#define GPDMA_C6SR_USEF_B_0X1           (0x1u<<12)
#define GPDMA_C6SR_ULEF_B_0X0           (0x0u<<11)
#define GPDMA_C6SR_ULEF_B_0X1           (0x1u<<11)
#define GPDMA_C6SR_DTEF_B_0X0           (0x0u<<10)
#define GPDMA_C6SR_DTEF_B_0X1           (0x1u<<10)
#define GPDMA_C6SR_HTF_B_0X0            (0x0u<<9)
#define GPDMA_C6SR_HTF_B_0X1            (0x1u<<9)
#define GPDMA_C6SR_TCF_B_0X0            (0x0u<<8)
#define GPDMA_C6SR_TCF_B_0X1            (0x1u<<8)
#define GPDMA_C6SR_IDLEF_B_0X0          (0x0u<<0)
#define GPDMA_C6SR_IDLEF_B_0X1          (0x1u<<0)

// C6CR Configuration

#define GPDMA_C6CR_PRIO                 (0x3u<<22)
#define GPDMA_C6CR_PRIO_0               (0x1u<<22)
#define GPDMA_C6CR_LAP                  (0x1u<<17)
#define GPDMA_C6CR_LSM                  (0x1u<<16)
#define GPDMA_C6CR_TOIE                 (0x1u<<14)
#define GPDMA_C6CR_SUSPIE               (0x1u<<13)
#define GPDMA_C6CR_USEIE                (0x1u<<12)
#define GPDMA_C6CR_ULEIE                (0x1u<<11)
#define GPDMA_C6CR_DTEIE                (0x1u<<10)
#define GPDMA_C6CR_HTIE                 (0x1u<<9)
#define GPDMA_C6CR_TCIE                 (0x1u<<8)
#define GPDMA_C6CR_SUSP                 (0x1u<<2)
#define GPDMA_C6CR_RESET                (0x1u<<1)
#define GPDMA_C6CR_EN                   (0x1u<<0)

#define GPDMA_C6CR_PRIO_B_0X0           (0x0u<<22)
#define GPDMA_C6CR_PRIO_B_0X1           (0x1u<<22)
#define GPDMA_C6CR_PRIO_B_0X2           (0x2u<<22)
#define GPDMA_C6CR_PRIO_B_0X3           (0x3u<<22)
#define GPDMA_C6CR_LAP_B_0X0            (0x0u<<17)
#define GPDMA_C6CR_LAP_B_0X1            (0x1u<<17)
#define GPDMA_C6CR_LSM_B_0X0            (0x0u<<16)
#define GPDMA_C6CR_LSM_B_0X1            (0x1u<<16)
#define GPDMA_C6CR_TOIE_B_0X0           (0x0u<<14)
#define GPDMA_C6CR_TOIE_B_0X1           (0x1u<<14)
#define GPDMA_C6CR_SUSPIE_B_0X0         (0x0u<<13)
#define GPDMA_C6CR_SUSPIE_B_0X1         (0x1u<<13)
#define GPDMA_C6CR_USEIE_B_0X0          (0x0u<<12)
#define GPDMA_C6CR_USEIE_B_0X1          (0x1u<<12)
#define GPDMA_C6CR_ULEIE_B_0X0          (0x0u<<11)
#define GPDMA_C6CR_ULEIE_B_0X1          (0x1u<<11)
#define GPDMA_C6CR_DTEIE_B_0X0          (0x0u<<10)
#define GPDMA_C6CR_DTEIE_B_0X1          (0x1u<<10)
#define GPDMA_C6CR_HTIE_B_0X0           (0x0u<<9)
#define GPDMA_C6CR_HTIE_B_0X1           (0x1u<<9)
#define GPDMA_C6CR_TCIE_B_0X0           (0x0u<<8)
#define GPDMA_C6CR_TCIE_B_0X1           (0x1u<<8)
#define GPDMA_C6CR_SUSP_B_0X0           (0x0u<<2)
#define GPDMA_C6CR_SUSP_B_0X1           (0x1u<<2)
#define GPDMA_C6CR_RESET_B_0X0          (0x0u<<1)
#define GPDMA_C6CR_RESET_B_0X1          (0x1u<<1)
#define GPDMA_C6CR_EN_B_0X0             (0x0u<<0)
#define GPDMA_C6CR_EN_B_0X1             (0x1u<<0)

// C6TR1 Configuration

#define GPDMA_C6TR1_DSEC                (0x1u<<31)
#define GPDMA_C6TR1_DAP                 (0x1u<<30)
#define GPDMA_C6TR1_DHX                 (0x1u<<27)
#define GPDMA_C6TR1_DBX                 (0x1u<<26)
#define GPDMA_C6TR1_DBL_1               (0x3Fu<<20)
#define GPDMA_C6TR1_DBL_1_0             (0x1u<<20)
#define GPDMA_C6TR1_DINC                (0x1u<<19)
#define GPDMA_C6TR1_DDW_LOG2            (0x3u<<16)
#define GPDMA_C6TR1_DDW_LOG2_0          (0x1u<<16)
#define GPDMA_C6TR1_SSEC                (0x1u<<15)
#define GPDMA_C6TR1_SAP                 (0x1u<<14)
#define GPDMA_C6TR1_SBX                 (0x1u<<13)
#define GPDMA_C6TR1_PAM                 (0x3u<<11)
#define GPDMA_C6TR1_PAM_0               (0x1u<<11)
#define GPDMA_C6TR1_SBL_1               (0x3Fu<<4)
#define GPDMA_C6TR1_SBL_1_0             (0x1u<<4)
#define GPDMA_C6TR1_SINC                (0x1u<<3)
#define GPDMA_C6TR1_SDW_LOG2            (0x3u<<0)
#define GPDMA_C6TR1_SDW_LOG2_0          (0x1u<<0)

#define GPDMA_C6TR1_DSEC_B_0X0          (0x0u<<31)
#define GPDMA_C6TR1_DSEC_B_0X1          (0x1u<<31)
#define GPDMA_C6TR1_DAP_B_0X0           (0x0u<<30)
#define GPDMA_C6TR1_DAP_B_0X1           (0x1u<<30)
#define GPDMA_C6TR1_DHX_B_0X0           (0x0u<<27)
#define GPDMA_C6TR1_DHX_B_0X1           (0x1u<<27)
#define GPDMA_C6TR1_DBX_B_0X0           (0x0u<<26)
#define GPDMA_C6TR1_DBX_B_0X1           (0x1u<<26)
#define GPDMA_C6TR1_DINC_B_0X0          (0x0u<<19)
#define GPDMA_C6TR1_DINC_B_0X1          (0x1u<<19)
#define GPDMA_C6TR1_DDW_LOG2_B_0X0      (0x0u<<16)
#define GPDMA_C6TR1_DDW_LOG2_B_0X1      (0x1u<<16)
#define GPDMA_C6TR1_DDW_LOG2_B_0X2      (0x2u<<16)
#define GPDMA_C6TR1_DDW_LOG2_B_0X3      (0x3u<<16)
#define GPDMA_C6TR1_SSEC_B_0X0          (0x0u<<15)
#define GPDMA_C6TR1_SSEC_B_0X1          (0x1u<<15)
#define GPDMA_C6TR1_SAP_B_0X0           (0x0u<<14)
#define GPDMA_C6TR1_SAP_B_0X1           (0x1u<<14)
#define GPDMA_C6TR1_SBX_B_0X0           (0x0u<<13)
#define GPDMA_C6TR1_SBX_B_0X1           (0x1u<<13)
#define GPDMA_C6TR1_PAM_B_0X0_PAM_1     (0x0u<<11)
#define GPDMA_C6TR1_PAM_B_0X1_PAM_1     (0x1u<<11)
#define GPDMA_C6TR1_PAM_B_0X2_PAM_1     (0x2u<<11)
#define GPDMA_C6TR1_PAM_B_0X3_PAM_1     (0x3u<<11)
#define GPDMA_C6TR1_SINC_B_0X0          (0x0u<<3)
#define GPDMA_C6TR1_SINC_B_0X1          (0x1u<<3)
#define GPDMA_C6TR1_SDW_LOG2_B_0X0      (0x0u<<0)
#define GPDMA_C6TR1_SDW_LOG2_B_0X1      (0x1u<<0)
#define GPDMA_C6TR1_SDW_LOG2_B_0X2      (0x2u<<0)
#define GPDMA_C6TR1_SDW_LOG2_B_0X3      (0x3u<<0)

// C6TR2 Configuration

#define GPDMA_C6TR2_TCEM                (0x3u<<30)
#define GPDMA_C6TR2_TCEM_0              (0x1u<<30)
#define GPDMA_C6TR2_TRIGPOL             (0x3u<<24)
#define GPDMA_C6TR2_TRIGPOL_0           (0x1u<<24)
#define GPDMA_C6TR2_TRIGSEL             (0x7Fu<<16)
#define GPDMA_C6TR2_TRIGSEL_0           (0x1u<<16)
#define GPDMA_C6TR2_TRIGM               (0x3u<<14)
#define GPDMA_C6TR2_TRIGM_0             (0x1u<<14)
#define GPDMA_C6TR2_PFREQ               (0x1u<<12)
#define GPDMA_C6TR2_BREQ                (0x1u<<11)
#define GPDMA_C6TR2_DREQ                (0x1u<<10)
#define GPDMA_C6TR2_SWREQ               (0x1u<<9)
#define GPDMA_C6TR2_REQSEL              (0xFFu<<0)
#define GPDMA_C6TR2_REQSEL_0            (0x1u<<0)

#define GPDMA_C6TR2_TCEM_B_0X0          (0x0u<<30)
#define GPDMA_C6TR2_TCEM_B_0X1          (0x1u<<30)
#define GPDMA_C6TR2_TCEM_B_0X2          (0x2u<<30)
#define GPDMA_C6TR2_TCEM_B_0X3          (0x3u<<30)
#define GPDMA_C6TR2_TRIGPOL_B_0X0       (0x0u<<24)
#define GPDMA_C6TR2_TRIGPOL_B_0X1       (0x1u<<24)
#define GPDMA_C6TR2_TRIGPOL_B_0X2       (0x2u<<24)
#define GPDMA_C6TR2_TRIGPOL_B_0X3       (0x3u<<24)
#define GPDMA_C6TR2_TRIGM_B_0X0         (0x0u<<14)
#define GPDMA_C6TR2_TRIGM_B_0X1         (0x1u<<14)
#define GPDMA_C6TR2_TRIGM_B_0X2         (0x2u<<14)
#define GPDMA_C6TR2_TRIGM_B_0X3         (0x3u<<14)
#define GPDMA_C6TR2_PFREQ_B_0X0         (0x0u<<12)
#define GPDMA_C6TR2_PFREQ_B_0X1         (0x1u<<12)
#define GPDMA_C6TR2_BREQ_B_0X0          (0x0u<<11)
#define GPDMA_C6TR2_BREQ_B_0X1          (0x1u<<11)
#define GPDMA_C6TR2_DREQ_B_0X0          (0x0u<<10)
#define GPDMA_C6TR2_DREQ_B_0X1          (0x1u<<10)
#define GPDMA_C6TR2_SWREQ_B_0X0         (0x0u<<9)
#define GPDMA_C6TR2_SWREQ_B_0X1         (0x1u<<9)

// C6BR1 Configuration

#define GPDMA_C6BR1_BNDT                (0xFFFFu<<0)
#define GPDMA_C6BR1_BNDT_0              (0x1u<<0)

// C6SAR Configuration

#define GPDMA_C6SAR_SA                  (0xFFFFFFFFu<<0)
#define GPDMA_C6SAR_SA_0                (0x1u<<0)

// C6DAR Configuration

#define GPDMA_C6DAR_DA                  (0xFFFFFFFFu<<0)
#define GPDMA_C6DAR_DA_0                (0x1u<<0)

// C6LLR Configuration

#define GPDMA_C6LLR_UT1                 (0x1u<<31)
#define GPDMA_C6LLR_UT2                 (0x1u<<30)
#define GPDMA_C6LLR_UB1                 (0x1u<<29)
#define GPDMA_C6LLR_USA                 (0x1u<<28)
#define GPDMA_C6LLR_UDA                 (0x1u<<27)
#define GPDMA_C6LLR_ULL                 (0x1u<<16)
#define GPDMA_C6LLR_LA                  (0x3FFFu<<2)
#define GPDMA_C6LLR_LA_0                (0x1u<<2)

#define GPDMA_C6LLR_UT1_B_0X0           (0x0u<<31)
#define GPDMA_C6LLR_UT1_B_0X1           (0x1u<<31)
#define GPDMA_C6LLR_UT2_B_0X0           (0x0u<<30)
#define GPDMA_C6LLR_UT2_B_0X1           (0x1u<<30)
#define GPDMA_C6LLR_UB1_B_0X0           (0x0u<<29)
#define GPDMA_C6LLR_UB1_B_0X1           (0x1u<<29)
#define GPDMA_C6LLR_USA_B_0X0           (0x0u<<28)
#define GPDMA_C6LLR_USA_B_0X1           (0x1u<<28)
#define GPDMA_C6LLR_UDA_B_0X0           (0x0u<<27)
#define GPDMA_C6LLR_UDA_B_0X1           (0x1u<<27)
#define GPDMA_C6LLR_ULL_B_0X0           (0x0u<<16)
#define GPDMA_C6LLR_ULL_B_0X1           (0x1u<<16)

// C7LBAR Configuration

#define GPDMA_C7LBAR_LBA                (0xFFFFu<<16)
#define GPDMA_C7LBAR_LBA_0              (0x1u<<16)

