Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpdma.h
// C7FCR Configuration

#define GPDMA_C7FCR_TOF                 (0x1u<<14)
#define GPDMA_C7FCR_SUSPF               (0x1u<<13)
#define GPDMA_C7FCR_USEF                (0x1u<<12)
#define GPDMA_C7FCR_ULEF                (0x1u<<11)
#define GPDMA_C7FCR_DTEF                (0x1u<<10)
#define GPDMA_C7FCR_HTF                 (0x1u<<9)
#define GPDMA_C7FCR_TCF                 (0x1u<<8)

#define GPDMA_C7FCR_TOF_B_0X0           (0x0u<<14)
#define GPDMA_C7FCR_TOF_B_0X1           (0x1u<<14)
#define GPDMA_C7FCR_SUSPF_B_0X0         (0x0u<<13)
#define GPDMA_C7FCR_SUSPF_B_0X1         (0x1u<<13)
#define GPDMA_C7FCR_USEF_B_0X0          (0x0u<<12)
#define GPDMA_C7FCR_USEF_B_0X1          (0x1u<<12)
#define GPDMA_C7FCR_ULEF_B_0X0          (0x0u<<11)
#define GPDMA_C7FCR_ULEF_B_0X1          (0x1u<<11)
#define GPDMA_C7FCR_DTEF_B_0X0          (0x0u<<10)
#define GPDMA_C7FCR_DTEF_B_0X1          (0x1u<<10)
#define GPDMA_C7FCR_HTF_B_0X0           (0x0u<<9)
#define GPDMA_C7FCR_HTF_B_0X1           (0x1u<<9)
#define GPDMA_C7FCR_TCF_B_0X0           (0x0u<<8)
#define GPDMA_C7FCR_TCF_B_0X1           (0x1u<<8)

// C7SR Configuration

#define GPDMA_C7SR_FIFOL                (0xFFu<<16)
#define GPDMA_C7SR_FIFOL_0              (0x1u<<16)
#define GPDMA_C7SR_TOF                  (0x1u<<14)
#define GPDMA_C7SR_SUSPF                (0x1u<<13)
#define GPDMA_C7SR_USEF                 (0x1u<<12)
#define GPDMA_C7SR_ULEF                 (0x1u<<11)
#define GPDMA_C7SR_DTEF                 (0x1u<<10)
#define GPDMA_C7SR_HTF                  (0x1u<<9)
#define GPDMA_C7SR_TCF                  (0x1u<<8)
#define GPDMA_C7SR_IDLEF                (0x1u<<0)

#define GPDMA_C7SR_TOF_B_0X0            (0x0u<<14)
#define GPDMA_C7SR_TOF_B_0X1            (0x1u<<14)
#define GPDMA_C7SR_SUSPF_B_0X0          (0x0u<<13)
#define GPDMA_C7SR_SUSPF_B_0X1          (0x1u<<13)
#define GPDMA_C7SR_USEF_B_0X0           (0x0u<<12)
#define GPDMA_C7SR_USEF_B_0X1           (0x1u<<12)
#define GPDMA_C7SR_ULEF_B_0X0           (0x0u<<11)
#define GPDMA_C7SR_ULEF_B_0X1           (0x1u<<11)
#define GPDMA_C7SR_DTEF_B_0X0           (0x0u<<10)
#define GPDMA_C7SR_DTEF_B_0X1           (0x1u<<10)
#define GPDMA_C7SR_HTF_B_0X0            (0x0u<<9)
#define GPDMA_C7SR_HTF_B_0X1            (0x1u<<9)
#define GPDMA_C7SR_TCF_B_0X0            (0x0u<<8)
#define GPDMA_C7SR_TCF_B_0X1            (0x1u<<8)
#define GPDMA_C7SR_IDLEF_B_0X0          (0x0u<<0)
#define GPDMA_C7SR_IDLEF_B_0X1          (0x1u<<0)

// C7CR Configuration

#define GPDMA_C7CR_PRIO                 (0x3u<<22)
#define GPDMA_C7CR_PRIO_0               (0x1u<<22)
#define GPDMA_C7CR_LAP                  (0x1u<<17)
#define GPDMA_C7CR_LSM                  (0x1u<<16)
#define GPDMA_C7CR_TOIE                 (0x1u<<14)
#define GPDMA_C7CR_SUSPIE               (0x1u<<13)
#define GPDMA_C7CR_USEIE                (0x1u<<12)
#define GPDMA_C7CR_ULEIE                (0x1u<<11)
#define GPDMA_C7CR_DTEIE                (0x1u<<10)
#define GPDMA_C7CR_HTIE                 (0x1u<<9)
#define GPDMA_C7CR_TCIE                 (0x1u<<8)
#define GPDMA_C7CR_SUSP                 (0x1u<<2)
#define GPDMA_C7CR_RESET                (0x1u<<1)
#define GPDMA_C7CR_EN                   (0x1u<<0)

#define GPDMA_C7CR_PRIO_B_0X0           (0x0u<<22)
#define GPDMA_C7CR_PRIO_B_0X1           (0x1u<<22)
#define GPDMA_C7CR_PRIO_B_0X2           (0x2u<<22)
#define GPDMA_C7CR_PRIO_B_0X3           (0x3u<<22)
#define GPDMA_C7CR_LAP_B_0X0            (0x0u<<17)
#define GPDMA_C7CR_LAP_B_0X1            (0x1u<<17)
#define GPDMA_C7CR_LSM_B_0X0            (0x0u<<16)
#define GPDMA_C7CR_LSM_B_0X1            (0x1u<<16)
#define GPDMA_C7CR_TOIE_B_0X0           (0x0u<<14)
#define GPDMA_C7CR_TOIE_B_0X1           (0x1u<<14)
#define GPDMA_C7CR_SUSPIE_B_0X0         (0x0u<<13)
#define GPDMA_C7CR_SUSPIE_B_0X1         (0x1u<<13)
#define GPDMA_C7CR_USEIE_B_0X0          (0x0u<<12)
#define GPDMA_C7CR_USEIE_B_0X1          (0x1u<<12)
#define GPDMA_C7CR_ULEIE_B_0X0          (0x0u<<11)
#define GPDMA_C7CR_ULEIE_B_0X1          (0x1u<<11)
#define GPDMA_C7CR_DTEIE_B_0X0          (0x0u<<10)
#define GPDMA_C7CR_DTEIE_B_0X1          (0x1u<<10)
#define GPDMA_C7CR_HTIE_B_0X0           (0x0u<<9)
#define GPDMA_C7CR_HTIE_B_0X1           (0x1u<<9)
#define GPDMA_C7CR_TCIE_B_0X0           (0x0u<<8)
#define GPDMA_C7CR_TCIE_B_0X1           (0x1u<<8)
#define GPDMA_C7CR_SUSP_B_0X0           (0x0u<<2)
#define GPDMA_C7CR_SUSP_B_0X1           (0x1u<<2)
#define GPDMA_C7CR_RESET_B_0X0          (0x0u<<1)
#define GPDMA_C7CR_RESET_B_0X1          (0x1u<<1)
#define GPDMA_C7CR_EN_B_0X0             (0x0u<<0)
#define GPDMA_C7CR_EN_B_0X1             (0x1u<<0)

// C7TR1 Configuration

#define GPDMA_C7TR1_DSEC                (0x1u<<31)
#define GPDMA_C7TR1_DAP                 (0x1u<<30)
#define GPDMA_C7TR1_DHX                 (0x1u<<27)
#define GPDMA_C7TR1_DBX                 (0x1u<<26)
#define GPDMA_C7TR1_DBL_1               (0x3Fu<<20)
#define GPDMA_C7TR1_DBL_1_0             (0x1u<<20)
#define GPDMA_C7TR1_DINC                (0x1u<<19)
#define GPDMA_C7TR1_DDW_LOG2            (0x3u<<16)
#define GPDMA_C7TR1_DDW_LOG2_0          (0x1u<<16)
#define GPDMA_C7TR1_SSEC                (0x1u<<15)
#define GPDMA_C7TR1_SAP                 (0x1u<<14)
#define GPDMA_C7TR1_SBX                 (0x1u<<13)
#define GPDMA_C7TR1_PAM                 (0x3u<<11)
#define GPDMA_C7TR1_PAM_0               (0x1u<<11)
#define GPDMA_C7TR1_SBL_1               (0x3Fu<<4)
#define GPDMA_C7TR1_SBL_1_0             (0x1u<<4)
#define GPDMA_C7TR1_SINC                (0x1u<<3)
#define GPDMA_C7TR1_SDW_LOG2            (0x3u<<0)
#define GPDMA_C7TR1_SDW_LOG2_0          (0x1u<<0)

#define GPDMA_C7TR1_DSEC_B_0X0          (0x0u<<31)
#define GPDMA_C7TR1_DSEC_B_0X1          (0x1u<<31)
#define GPDMA_C7TR1_DAP_B_0X0           (0x0u<<30)
#define GPDMA_C7TR1_DAP_B_0X1           (0x1u<<30)
#define GPDMA_C7TR1_DHX_B_0X0           (0x0u<<27)
#define GPDMA_C7TR1_DHX_B_0X1           (0x1u<<27)
#define GPDMA_C7TR1_DBX_B_0X0           (0x0u<<26)
#define GPDMA_C7TR1_DBX_B_0X1           (0x1u<<26)
#define GPDMA_C7TR1_DINC_B_0X0          (0x0u<<19)
#define GPDMA_C7TR1_DINC_B_0X1          (0x1u<<19)
#define GPDMA_C7TR1_DDW_LOG2_B_0X0      (0x0u<<16)
#define GPDMA_C7TR1_DDW_LOG2_B_0X1      (0x1u<<16)
#define GPDMA_C7TR1_DDW_LOG2_B_0X2      (0x2u<<16)
#define GPDMA_C7TR1_DDW_LOG2_B_0X3      (0x3u<<16)
#define GPDMA_C7TR1_SSEC_B_0X0          (0x0u<<15)
#define GPDMA_C7TR1_SSEC_B_0X1          (0x1u<<15)
#define GPDMA_C7TR1_SAP_B_0X0           (0x0u<<14)
#define GPDMA_C7TR1_SAP_B_0X1           (0x1u<<14)
#define GPDMA_C7TR1_SBX_B_0X0           (0x0u<<13)
#define GPDMA_C7TR1_SBX_B_0X1           (0x1u<<13)
#define GPDMA_C7TR1_PAM_B_0X0_PAM_1     (0x0u<<11)
#define GPDMA_C7TR1_PAM_B_0X1_PAM_1     (0x1u<<11)
#define GPDMA_C7TR1_PAM_B_0X2_PAM_1     (0x2u<<11)
#define GPDMA_C7TR1_PAM_B_0X3_PAM_1     (0x3u<<11)
#define GPDMA_C7TR1_SINC_B_0X0          (0x0u<<3)
#define GPDMA_C7TR1_SINC_B_0X1          (0x1u<<3)
#define GPDMA_C7TR1_SDW_LOG2_B_0X0      (0x0u<<0)
#define GPDMA_C7TR1_SDW_LOG2_B_0X1      (0x1u<<0)
#define GPDMA_C7TR1_SDW_LOG2_B_0X2      (0x2u<<0)
#define GPDMA_C7TR1_SDW_LOG2_B_0X3      (0x3u<<0)

// C7TR2 Configuration

#define GPDMA_C7TR2_TCEM                (0x3u<<30)
#define GPDMA_C7TR2_TCEM_0              (0x1u<<30)
#define GPDMA_C7TR2_TRIGPOL             (0x3u<<24)
#define GPDMA_C7TR2_TRIGPOL_0           (0x1u<<24)
#define GPDMA_C7TR2_TRIGSEL             (0x7Fu<<16)
#define GPDMA_C7TR2_TRIGSEL_0           (0x1u<<16)
#define GPDMA_C7TR2_TRIGM               (0x3u<<14)
#define GPDMA_C7TR2_TRIGM_0             (0x1u<<14)
#define GPDMA_C7TR2_PFREQ               (0x1u<<12)
#define GPDMA_C7TR2_BREQ                (0x1u<<11)
#define GPDMA_C7TR2_DREQ                (0x1u<<10)
#define GPDMA_C7TR2_SWREQ               (0x1u<<9)
#define GPDMA_C7TR2_REQSEL              (0xFFu<<0)
#define GPDMA_C7TR2_REQSEL_0            (0x1u<<0)

#define GPDMA_C7TR2_TCEM_B_0X0          (0x0u<<30)
#define GPDMA_C7TR2_TCEM_B_0X1          (0x1u<<30)
#define GPDMA_C7TR2_TCEM_B_0X2          (0x2u<<30)
#define GPDMA_C7TR2_TCEM_B_0X3          (0x3u<<30)
#define GPDMA_C7TR2_TRIGPOL_B_0X0       (0x0u<<24)
#define GPDMA_C7TR2_TRIGPOL_B_0X1       (0x1u<<24)
#define GPDMA_C7TR2_TRIGPOL_B_0X2       (0x2u<<24)
#define GPDMA_C7TR2_TRIGPOL_B_0X3       (0x3u<<24)
#define GPDMA_C7TR2_TRIGM_B_0X0         (0x0u<<14)
#define GPDMA_C7TR2_TRIGM_B_0X1         (0x1u<<14)
#define GPDMA_C7TR2_TRIGM_B_0X2         (0x2u<<14)
#define GPDMA_C7TR2_TRIGM_B_0X3         (0x3u<<14)
#define GPDMA_C7TR2_PFREQ_B_0X0         (0x0u<<12)
#define GPDMA_C7TR2_PFREQ_B_0X1         (0x1u<<12)
#define GPDMA_C7TR2_BREQ_B_0X0          (0x0u<<11)
#define GPDMA_C7TR2_BREQ_B_0X1          (0x1u<<11)
#define GPDMA_C7TR2_DREQ_B_0X0          (0x0u<<10)
#define GPDMA_C7TR2_DREQ_B_0X1          (0x1u<<10)
#define GPDMA_C7TR2_SWREQ_B_0X0         (0x0u<<9)
#define GPDMA_C7TR2_SWREQ_B_0X1         (0x1u<<9)

// C7BR1 Configuration

#define GPDMA_C7BR1_BNDT                (0xFFFFu<<0)
#define GPDMA_C7BR1_BNDT_0              (0x1u<<0)

// C7SAR Configuration

#define GPDMA_C7SAR_SA                  (0xFFFFFFFFu<<0)
#define GPDMA_C7SAR_SA_0                (0x1u<<0)

