Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpdma.h
#define GPDMA_C9BR1_BRDDEC              (0x1u<<31)
#define GPDMA_C9BR1_BRSDEC              (0x1u<<30)
#define GPDMA_C9BR1_DDEC                (0x1u<<29)
#define GPDMA_C9BR1_SDEC                (0x1u<<28)
#define GPDMA_C9BR1_BRC                 (0x7FFu<<16)
#define GPDMA_C9BR1_BRC_0               (0x1u<<16)
#define GPDMA_C9BR1_BNDT                (0xFFFFu<<0)
#define GPDMA_C9BR1_BNDT_0              (0x1u<<0)

#define GPDMA_C9BR1_BRDDEC_B_0X0        (0x0u<<31)
#define GPDMA_C9BR1_BRDDEC_B_0X1        (0x1u<<31)
#define GPDMA_C9BR1_BRSDEC_B_0X0        (0x0u<<30)
#define GPDMA_C9BR1_BRSDEC_B_0X1        (0x1u<<30)
#define GPDMA_C9BR1_DDEC_B_0X0          (0x0u<<29)
#define GPDMA_C9BR1_DDEC_B_0X1          (0x1u<<29)
#define GPDMA_C9BR1_SDEC_B_0X0          (0x0u<<28)
#define GPDMA_C9BR1_SDEC_B_0X1          (0x1u<<28)

// C9SAR Configuration

#define GPDMA_C9SAR_SA                  (0xFFFFFFFFu<<0)
#define GPDMA_C9SAR_SA_0                (0x1u<<0)

// C9DAR Configuration

#define GPDMA_C9DAR_DA                  (0xFFFFFFFFu<<0)
#define GPDMA_C9DAR_DA_0                (0x1u<<0)

// C9TR3 Configuration

#define GPDMA_C9TR3_DAO                 (0x1FFFu<<16)
#define GPDMA_C9TR3_DAO_0               (0x1u<<16)
#define GPDMA_C9TR3_SAO                 (0x1FFFu<<0)
#define GPDMA_C9TR3_SAO_0               (0x1u<<0)

// C9BR2 Configuration

#define GPDMA_C9BR2_BRDAO               (0xFFFFu<<16)
#define GPDMA_C9BR2_BRDAO_0             (0x1u<<16)
#define GPDMA_C9BR2_BRSAO               (0xFFFFu<<0)
#define GPDMA_C9BR2_BRSAO_0             (0x1u<<0)

// C9LLR Configuration

#define GPDMA_C9LLR_UT1                 (0x1u<<31)
#define GPDMA_C9LLR_UT2                 (0x1u<<30)
#define GPDMA_C9LLR_UB1                 (0x1u<<29)
#define GPDMA_C9LLR_USA                 (0x1u<<28)
#define GPDMA_C9LLR_UDA                 (0x1u<<27)
#define GPDMA_C9LLR_UT3                 (0x1u<<26)
#define GPDMA_C9LLR_UB2                 (0x1u<<25)
#define GPDMA_C9LLR_ULL                 (0x1u<<16)
#define GPDMA_C9LLR_LA                  (0x3FFFu<<2)
#define GPDMA_C9LLR_LA_0                (0x1u<<2)

#define GPDMA_C9LLR_UT1_B_0X0           (0x0u<<31)
#define GPDMA_C9LLR_UT1_B_0X1           (0x1u<<31)
#define GPDMA_C9LLR_UT2_B_0X0           (0x0u<<30)
#define GPDMA_C9LLR_UT2_B_0X1           (0x1u<<30)
#define GPDMA_C9LLR_UB1_B_0X0           (0x0u<<29)
#define GPDMA_C9LLR_UB1_B_0X1           (0x1u<<29)
#define GPDMA_C9LLR_USA_B_0X0           (0x0u<<28)
#define GPDMA_C9LLR_USA_B_0X1           (0x1u<<28)
#define GPDMA_C9LLR_UDA_B_0X0           (0x0u<<27)
#define GPDMA_C9LLR_UDA_B_0X1           (0x1u<<27)
#define GPDMA_C9LLR_UT3_B_0X0           (0x0u<<26)
#define GPDMA_C9LLR_UT3_B_0X1           (0x1u<<26)
#define GPDMA_C9LLR_UB2_B_0X0           (0x0u<<25)
#define GPDMA_C9LLR_UB2_B_0X1           (0x1u<<25)
#define GPDMA_C9LLR_ULL_B_0X0           (0x0u<<16)
#define GPDMA_C9LLR_ULL_B_0X1           (0x1u<<16)

// C10LBAR Configuration

#define GPDMA_C10LBAR_LBA               (0xFFFFu<<16)
#define GPDMA_C10LBAR_LBA_0             (0x1u<<16)

// C10FCR Configuration

#define GPDMA_C10FCR_TOF                (0x1u<<14)
#define GPDMA_C10FCR_SUSPF              (0x1u<<13)
#define GPDMA_C10FCR_USEF               (0x1u<<12)
#define GPDMA_C10FCR_ULEF               (0x1u<<11)
#define GPDMA_C10FCR_DTEF               (0x1u<<10)
#define GPDMA_C10FCR_HTF                (0x1u<<9)
#define GPDMA_C10FCR_TCF                (0x1u<<8)

#define GPDMA_C10FCR_TOF_B_0X0          (0x0u<<14)
#define GPDMA_C10FCR_TOF_B_0X1          (0x1u<<14)
#define GPDMA_C10FCR_SUSPF_B_0X0        (0x0u<<13)
#define GPDMA_C10FCR_SUSPF_B_0X1        (0x1u<<13)
#define GPDMA_C10FCR_USEF_B_0X0         (0x0u<<12)
#define GPDMA_C10FCR_USEF_B_0X1         (0x1u<<12)
#define GPDMA_C10FCR_ULEF_B_0X0         (0x0u<<11)
#define GPDMA_C10FCR_ULEF_B_0X1         (0x1u<<11)
#define GPDMA_C10FCR_DTEF_B_0X0         (0x0u<<10)
#define GPDMA_C10FCR_DTEF_B_0X1         (0x1u<<10)
#define GPDMA_C10FCR_HTF_B_0X0          (0x0u<<9)
#define GPDMA_C10FCR_HTF_B_0X1          (0x1u<<9)
#define GPDMA_C10FCR_TCF_B_0X0          (0x0u<<8)
#define GPDMA_C10FCR_TCF_B_0X1          (0x1u<<8)

// C10SR Configuration

#define GPDMA_C10SR_FIFOL               (0xFFu<<16)
#define GPDMA_C10SR_FIFOL_0             (0x1u<<16)
#define GPDMA_C10SR_TOF                 (0x1u<<14)
#define GPDMA_C10SR_SUSPF               (0x1u<<13)
#define GPDMA_C10SR_USEF                (0x1u<<12)
#define GPDMA_C10SR_ULEF                (0x1u<<11)
#define GPDMA_C10SR_DTEF                (0x1u<<10)
#define GPDMA_C10SR_HTF                 (0x1u<<9)
#define GPDMA_C10SR_TCF                 (0x1u<<8)
#define GPDMA_C10SR_IDLEF               (0x1u<<0)

#define GPDMA_C10SR_TOF_B_0X0           (0x0u<<14)
#define GPDMA_C10SR_TOF_B_0X1           (0x1u<<14)
#define GPDMA_C10SR_SUSPF_B_0X0         (0x0u<<13)
#define GPDMA_C10SR_SUSPF_B_0X1         (0x1u<<13)
#define GPDMA_C10SR_USEF_B_0X0          (0x0u<<12)
#define GPDMA_C10SR_USEF_B_0X1          (0x1u<<12)
#define GPDMA_C10SR_ULEF_B_0X0          (0x0u<<11)
#define GPDMA_C10SR_ULEF_B_0X1          (0x1u<<11)
#define GPDMA_C10SR_DTEF_B_0X0          (0x0u<<10)
#define GPDMA_C10SR_DTEF_B_0X1          (0x1u<<10)
#define GPDMA_C10SR_HTF_B_0X0           (0x0u<<9)
#define GPDMA_C10SR_HTF_B_0X1           (0x1u<<9)
#define GPDMA_C10SR_TCF_B_0X0           (0x0u<<8)
#define GPDMA_C10SR_TCF_B_0X1           (0x1u<<8)
#define GPDMA_C10SR_IDLEF_B_0X0         (0x0u<<0)
#define GPDMA_C10SR_IDLEF_B_0X1         (0x1u<<0)

// C10CR Configuration

#define GPDMA_C10CR_PRIO                (0x3u<<22)
#define GPDMA_C10CR_PRIO_0              (0x1u<<22)
#define GPDMA_C10CR_LAP                 (0x1u<<17)
#define GPDMA_C10CR_LSM                 (0x1u<<16)
#define GPDMA_C10CR_TOIE                (0x1u<<14)
#define GPDMA_C10CR_SUSPIE              (0x1u<<13)
#define GPDMA_C10CR_USEIE               (0x1u<<12)
#define GPDMA_C10CR_ULEIE               (0x1u<<11)
#define GPDMA_C10CR_DTEIE               (0x1u<<10)
#define GPDMA_C10CR_HTIE                (0x1u<<9)
#define GPDMA_C10CR_TCIE                (0x1u<<8)
#define GPDMA_C10CR_SUSP                (0x1u<<2)
#define GPDMA_C10CR_RESET               (0x1u<<1)
#define GPDMA_C10CR_EN                  (0x1u<<0)

#define GPDMA_C10CR_PRIO_B_0X0          (0x0u<<22)
#define GPDMA_C10CR_PRIO_B_0X1          (0x1u<<22)
#define GPDMA_C10CR_PRIO_B_0X2          (0x2u<<22)
#define GPDMA_C10CR_PRIO_B_0X3          (0x3u<<22)
#define GPDMA_C10CR_LAP_B_0X0           (0x0u<<17)
#define GPDMA_C10CR_LAP_B_0X1           (0x1u<<17)
#define GPDMA_C10CR_LSM_B_0X0           (0x0u<<16)
#define GPDMA_C10CR_LSM_B_0X1           (0x1u<<16)
#define GPDMA_C10CR_TOIE_B_0X0          (0x0u<<14)
#define GPDMA_C10CR_TOIE_B_0X1          (0x1u<<14)
#define GPDMA_C10CR_SUSPIE_B_0X0        (0x0u<<13)
#define GPDMA_C10CR_SUSPIE_B_0X1        (0x1u<<13)
#define GPDMA_C10CR_USEIE_B_0X0         (0x0u<<12)
#define GPDMA_C10CR_USEIE_B_0X1         (0x1u<<12)
#define GPDMA_C10CR_ULEIE_B_0X0         (0x0u<<11)
#define GPDMA_C10CR_ULEIE_B_0X1         (0x1u<<11)
#define GPDMA_C10CR_DTEIE_B_0X0         (0x0u<<10)
#define GPDMA_C10CR_DTEIE_B_0X1         (0x1u<<10)
#define GPDMA_C10CR_HTIE_B_0X0          (0x0u<<9)
#define GPDMA_C10CR_HTIE_B_0X1          (0x1u<<9)
#define GPDMA_C10CR_TCIE_B_0X0          (0x0u<<8)
#define GPDMA_C10CR_TCIE_B_0X1          (0x1u<<8)
#define GPDMA_C10CR_SUSP_B_0X0          (0x0u<<2)
#define GPDMA_C10CR_SUSP_B_0X1          (0x1u<<2)
#define GPDMA_C10CR_RESET_B_0X0         (0x0u<<1)
#define GPDMA_C10CR_RESET_B_0X1         (0x1u<<1)
#define GPDMA_C10CR_EN_B_0X0            (0x0u<<0)
#define GPDMA_C10CR_EN_B_0X1            (0x1u<<0)

// C10TR1 Configuration

