Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpdma.h
#define GPDMA_C11SAR_SA                 (0xFFFFFFFFu<<0)
#define GPDMA_C11SAR_SA_0               (0x1u<<0)

// C11DAR Configuration

#define GPDMA_C11DAR_DA                 (0xFFFFFFFFu<<0)
#define GPDMA_C11DAR_DA_0               (0x1u<<0)

// C11TR3 Configuration

#define GPDMA_C11TR3_DAO                (0x1FFFu<<16)
#define GPDMA_C11TR3_DAO_0              (0x1u<<16)
#define GPDMA_C11TR3_SAO                (0x1FFFu<<0)
#define GPDMA_C11TR3_SAO_0              (0x1u<<0)

// C11BR2 Configuration

#define GPDMA_C11BR2_BRDAO              (0xFFFFu<<16)
#define GPDMA_C11BR2_BRDAO_0            (0x1u<<16)
#define GPDMA_C11BR2_BRSAO              (0xFFFFu<<0)
#define GPDMA_C11BR2_BRSAO_0            (0x1u<<0)

// C11LLR Configuration

#define GPDMA_C11LLR_UT1                (0x1u<<31)
#define GPDMA_C11LLR_UT2                (0x1u<<30)
#define GPDMA_C11LLR_UB1                (0x1u<<29)
#define GPDMA_C11LLR_USA                (0x1u<<28)
#define GPDMA_C11LLR_UDA                (0x1u<<27)
#define GPDMA_C11LLR_UT3                (0x1u<<26)
#define GPDMA_C11LLR_UB2                (0x1u<<25)
#define GPDMA_C11LLR_ULL                (0x1u<<16)
#define GPDMA_C11LLR_LA                 (0x3FFFu<<2)
#define GPDMA_C11LLR_LA_0               (0x1u<<2)

#define GPDMA_C11LLR_UT1_B_0X0          (0x0u<<31)
#define GPDMA_C11LLR_UT1_B_0X1          (0x1u<<31)
#define GPDMA_C11LLR_UT2_B_0X0          (0x0u<<30)
#define GPDMA_C11LLR_UT2_B_0X1          (0x1u<<30)
#define GPDMA_C11LLR_UB1_B_0X0          (0x0u<<29)
#define GPDMA_C11LLR_UB1_B_0X1          (0x1u<<29)
#define GPDMA_C11LLR_USA_B_0X0          (0x0u<<28)
#define GPDMA_C11LLR_USA_B_0X1          (0x1u<<28)
#define GPDMA_C11LLR_UDA_B_0X0          (0x0u<<27)
#define GPDMA_C11LLR_UDA_B_0X1          (0x1u<<27)
#define GPDMA_C11LLR_UT3_B_0X0          (0x0u<<26)
#define GPDMA_C11LLR_UT3_B_0X1          (0x1u<<26)
#define GPDMA_C11LLR_UB2_B_0X0          (0x0u<<25)
#define GPDMA_C11LLR_UB2_B_0X1          (0x1u<<25)
#define GPDMA_C11LLR_ULL_B_0X0          (0x0u<<16)
#define GPDMA_C11LLR_ULL_B_0X1          (0x1u<<16)
